/*********************************************************************************************
* 文件：Relay.h
* 作者：Lixm 2017.10.17
* 说明：继电器驱动代码头文件  
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 宏条件编译
*********************************************************************************************/
#ifndef __RELAY_H__
#define __RELAY_H__

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "stm32f4xx.h"

#define RELAY_RCC               RCC_AHB1Periph_GPIOE
#define RELAY_PORT              GPIOE
#define RELAY1_PIN              GPIO_Pin_2
#define RELAY2_PIN              GPIO_Pin_3

#define RELAY1_CTRL(a)          if(!a) GPIO_WriteBit(RELAY_PORT, RELAY1_PIN, Bit_SET); \
                                else GPIO_WriteBit(RELAY_PORT, RELAY1_PIN, Bit_RESET)
                                  
#define RELAY2_CTRL(a)          if(!a) GPIO_WriteBit(RELAY_PORT, RELAY2_PIN, Bit_SET); \
                                else GPIO_WriteBit(RELAY_PORT, RELAY2_PIN, Bit_RESET)
                                  
/*********************************************************************************************
* 内部原型函数
*********************************************************************************************/
void relay_init(void);                                          //继电器传感器初始化
void relay_control(unsigned char cmd);                        //继电器传感器控制

#endif /*__INFRARED_H__*/

